'声明变量
Dim b,k,x

'输入数据
k=inputbox("kx+b=0(k≠0),k=","解一元一次方程（不支持输入代数式、分数（有限小数除外）和无理数，结果不支持保留分数形式和根号）")

'判断k是否≠0
If  k<0 or k>0 Then

    '输入数据
    b=inputbox(""&k&"x+b=0,b=","解一元一次方程（不支持输入代数式、分数（有限小数除外）和无理数，结果不支持保留分数形式和根号）")

    '用公式法解方程
    x=-b/k

    '输出结果
    msgbox"x="&x&"",0,""&k&"x+"&b&"=0的解"
    msgbox"y="&k&"x+"&b&"⊥y="&-1/k&"+"&b&"",0,"与y="&k&"x+"&b&"的图像垂直的函数"
    msgbox"(0,"&b&")和("&x&",0)",0,"y="&k&"x+"&b&"与坐标轴的交点坐标"

else

   '如果k=0，那么报错
    msgbox"一元一次方程的一次项不能等于零(k≠0)。",16,"解一元一次方程（不支持输入代数式、分数（有限小数除外）和无理数，结果不支持保留分数形式和根号）"

End If